blood-LES/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p; //Units are Pascals divided by the density
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0; 

boundaryField
{
    inlet-I
    {
        type            zeroGradient;
    }

    inletWall-III
    {
        type            zeroGradient;
    }

    outlet
    {
        type            totalPressure;
	p0		$internalField;
    }

    topWall
    {
        type            zeroGradient;
    }

    internalWall
    {
        type            zeroGradient;
    }


    #include "include/patchesWalls"

}

// ************************************************************************* //
