blood-LES/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;            // EPSILON = Turbulent Dissipation Rate recalculate
				    // for each new case.   e=Cu*((k^(3/2))/l)   
				    // Cu=Turbulent Constant=0.09
				    // k=Turbulent Kinetic Energy     l=Turbulent Length Scale
				    // l can be estimated.  l=0.038*dh   dh=pipe diameter
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 200 ;  //200 - 0.0495         

boundaryField
{
    inlet-I
    {
        type            fixedValue;
        value           $internalField;
    }

    inletWall-III
    {
        type            epsilonWallFunction;
        value           $internalField; 
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField; 
    }

    topWall
    {
        type            epsilonWallFunction;
        value           $internalField;	
    }

    internalWall
    {
        type            epsilonWallFunction;
        value           $internalField;	
    }

    #include "include/patchesWalls"

}


// ************************************************************************* //
