blood-LES/0/include/patchesWalls
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

    back
    {
        type            wedge;
    }

    front
    {
        type            wedge;
    }

    axis
    {
        type            empty;
    }

    "(antWall-III|antWall-IV)"
    {
        type            zeroGradient;	
    }

// ************************************************************************* //
